app/controllers/api/line_graphs_controller.rb

SELECT `transactions`.* FROM `transactions` ORDER BY date DESC
---
    def index
#     if(start_date && end_date)
#       puts "recieved params"
#       start_d = DateTime.parse(start_date)
#       end_d = DateTime.parse(end_date)
#       #transactions = Transaction.where(date: start_d..end_d).order('date DESC')
#     else
#       graph_data = LineGraphs.order('date DESC')
#     end
      graph_data = Transaction.order('date DESC')