app/controllers/api/transactions_controller.rb

SELECT MAX(`transactions`.`date`) FROM `transactions` WHERE (date < '2017-08-04 00:00:00')
SELECT `transactions`.* FROM `transactions` WHERE (`transactions`.`date` >= '2017-07-30' AND `transactions`.`date` < '2017-08-10') ORDER BY date ASC
SELECT `transactions`.* FROM `transactions` ORDER BY date DESC
---
    def index
      if(start_date && end_date)
        puts "recieved params"
        start_d = DateTime.parse(start_date)
        end_d = DateTime.parse(end_date)
        transactions = Transaction.where(date: start_d..end_d).order('date DESC')
      else
        transactions = Transaction.order('date DESC')

INSERT INTO `transactions` (`debit`, `balance`, `date`, `name`, `location`, `category`, `description`, `created_at`, `updated_at`) VALUES (9.62, 2642.14, '2017-08-06', 'PIER 66 MARITIME', 'NEW YORK, NY, US', 'Bars', 'PIER 66 MARITIME              POS     NEW YORK      NY US        000075', '2017-08-06 18:36:48', '2017-08-06 18:36:48')
---
    def create
      transactions = Transaction.new(_params)
      if transactions.save